       01  REGISTRO.
           05 REG-AGENCIA    PIC X(4).
           05 REG-CONTA      PIC X(5).
           05 REG-NOME       PIC X(30).
           05 REG-GERENTE    PIC X(003).
           05 REG-TIPO-CONTA PIC 9(01).
           05 REG-SALDO      PIC 9(10)V99.