       IDENTIFICATION DIVISION. 
       PROGRAM-ID. OLACOBOL. 
      * Comentário: Este é um programa simples que exibe "OLA COBOL" 
       PROCEDURE DIVISION. 
           DISPLAY "OLA COBOL". 
           STOP RUN.